# Глава 2. Распознавание и обработка временных рядов

In [1]:
import numpy as np
import pandas as pd

## Учебная дазача: Получение временных рядов

### Загрузим данные

In [2]:
year_joined = pd.read_csv("data_nilsen/year_joined.csv")
emails = pd.read_csv("data_nilsen/emails.csv")
donations = pd.read_csv("data_nilsen/donations.csv")

Сначала в имеюшихся данных надо определить временные оси.

### DataFrame year_joined

In [3]:
year_joined.head()

   user userStats  yearJoined
0     0    silver        2014
1     1    silver        2015
2     2    silver        2016
3     3    bronze        2018
4     4    silver        2018

Надо увостовериться, что текущий статус пользователя определяется его годовым, а не другим, более краткосрочным статусом.

Для этого смотрим, сколько записей имеет каждый пользователь:

In [4]:
year_joined.groupby('user').count()

      userStats  yearJoined
user
0             1           1
1             1           1
2             1           1
3             1           1
4             1           1
...         ...         ...
995           1           1
996           1           1
997           1           1
998           1           1
999           1           1

[1000 rows x 2 columns]

In [5]:
year_joined.groupby('user').count().groupby('userStats').count()

           yearJoined
userStats
1                1000

Результат:
- Всего имеет 1000 пользователей.
- У каждого из них по одной записи.

### DataFrame emails

In [6]:
emails.head()

   emailsOpened  user                 week
0           3.0   1.0  2015-06-29 00:00:00
1           2.0   1.0  2015-07-13 00:00:00
2           2.0   1.0  2015-07-20 00:00:00
3           3.0   1.0  2015-07-27 00:00:00
4           1.0   1.0  2015-08-03 00:00:00

Преобразуем строки в колонке week в формат datetime

In [7]:
emails.week = pd.to_datetime(emails.week)
emails.head()

   emailsOpened  user       week
0           3.0   1.0 2015-06-29
1           2.0   1.0 2015-07-13
2           2.0   1.0 2015-07-20
3           3.0   1.0 2015-07-27
4           1.0   1.0 2015-08-03

Проверим, существуют ли пустые недели, когда пользователь не открыл ни одного электронного письма:

In [8]:
emails[emails.emailsOpened < 1]

Empty DataFrame
Columns: [emailsOpened, user, week]
Index: []

Ага. Пусто. Здесь у нас два варианта: либо пустые недели не регистрируются, либо пользователи открывают каждую неделю хотя бы одно электронное письмо.

Посмотрим историю работы с электронной почтой одного пользователя:

In [9]:
emails[emails.user == 998].head(15)

       emailsOpened   user       week
25464           1.0  998.0 2017-12-04
25465           3.0  998.0 2017-12-11
25466           3.0  998.0 2017-12-18
25467           3.0  998.0 2018-01-01
25468           3.0  998.0 2018-01-08
25469           2.0  998.0 2018-01-15
25470           3.0  998.0 2018-01-22
25471           2.0  998.0 2018-01-29
25472           3.0  998.0 2018-02-05
25473           3.0  998.0 2018-02-12
25474           3.0  998.0 2018-02-19
25475           2.0  998.0 2018-02-26
25476           2.0  998.0 2018-03-05
25477           3.0  998.0 2018-03-12
25478           2.0  998.0 2018-03-19

Результат: отдельные недели не указаны в списке.

Посчитаем количество еженедельных наблюдений между первым и последним событиями:

In [10]:
max_week = max(emails[emails.user == 998].week)
max_week

Timestamp('2018-05-28 00:00:00')

In [11]:
min_week = min(emails[emails.user == 998].week)
min_week

Timestamp('2017-12-04 00:00:00')

In [12]:
(max_week - min_week).days / 7

25.0

Между начальной и конечной учетной записью должно пройти 26 недель (25 + 1)

А сколько недель заданы для пользователя 998?

In [13]:
emails[emails.user == 998].shape

(24, 3)

Ага! 24, а должно быть 26...
Нам удалось выяснить, что в наборе есть недоствющие данные, для некоторых недель они не указаны.

Заполним недостающие недели:
- для этого сгенерируем объект Multiindex из нашего датафрейма, который представляет все комбинации недель и пользователей организации (декартово произведение);
- используем полученный индекс для переиндексации исходной таблицы и заполнения пропущенных значений нулем;

In [14]:
complete_idx = pd.MultiIndex.from_product((set(emails.week), set(emails.user)))
complete_idx.shape

(93247,)

In [15]:
complete_idx[:10]

MultiIndex([('2015-04-06',  1.0),
            ('2015-04-06',  3.0),
            ('2015-04-06',  5.0),
            ('2015-04-06',  6.0),
            ('2015-04-06',  9.0),
            ('2015-04-06', 10.0),
            ('2015-04-06', 14.0),
            ('2015-04-06', 16.0),
            ('2015-04-06', 20.0),
            ('2015-04-06', 21.0)],
           )

In [16]:
all_email = emails.set_index(['week', 'user']).reindex(complete_idx, fill_value = 0).reset_index()

In [17]:
all_email.head()

     level_0  level_1  emailsOpened
0 2015-04-06      1.0           0.0
1 2015-04-06      3.0           0.0
2 2015-04-06      5.0           0.0
3 2015-04-06      6.0           0.0
4 2015-04-06      9.0           0.0

Переименуем столбцы:

In [30]:
all_email.columns = ['week', 'user', 'emailsOpened']
all_email.head()

        week  user  emailsOpened
0 2015-04-06   1.0           0.0
1 2015-04-06   3.0           0.0
2 2015-04-06   5.0           0.0
3 2015-04-06   6.0           0.0
4 2015-04-06   9.0           0.0

В результате у многих пользователей значения emailsOpened могут равняться нулю, так как у каждого из них разные сроки начала и окончания полуяения электронной почты.

Задача: **Удалить все нулевые строки** перед первым ненулевыми строками и после последних ненулевых строк каждого пользователя.

Выбираем минимальное и максимальное значение недели для каждого пользователя.

In [47]:
cutoff_dates = (emails.groupby('user').week
                      .agg(['min', 'max']))
cutoff_dates = cutoff_dates.reset_index()

In [48]:
cutoff_dates

      user        min        max
0      1.0 2015-06-29 2018-05-28
1      3.0 2018-03-05 2018-04-23
2      5.0 2017-06-05 2018-05-28
3      6.0 2016-12-05 2018-05-28
4      9.0 2016-07-18 2018-05-28
..     ...        ...        ...
534  991.0 2016-10-24 2016-10-24
535  992.0 2015-02-09 2015-07-06
536  993.0 2017-09-11 2018-05-28
537  995.0 2016-09-05 2018-05-28
538  998.0 2017-12-04 2018-05-28

[539 rows x 3 columns]

### iterrows()

**iterrows()** выполняет итерацию по строкам **df** в виде кортежей **(index, Series)**.
Эта функция преобразует каждую строку в объект **Series**, что вызывает две проблемы:
- может измениться тип данных;
- преобразование значетельно снижает производительность.
Поэтому функция **iterrows()** является худшим методом для фактической итерации по строкам.

In [64]:
i = 0
for _, k in cutoff_dates.iterrows():
    print(k)
    i += 1
    if i == 5:
        break

user                    1.0
min     2015-06-29 00:00:00
max     2018-05-28 00:00:00
Name: 0, dtype: object
user                    3.0
min     2018-03-05 00:00:00
max     2018-04-23 00:00:00
Name: 1, dtype: object
user                    5.0
min     2017-06-05 00:00:00
max     2018-05-28 00:00:00
Name: 2, dtype: object
user                    6.0
min     2016-12-05 00:00:00
max     2018-05-28 00:00:00
Name: 3, dtype: object
user                    9.0
min     2016-07-18 00:00:00
max     2018-05-28 00:00:00
Name: 4, dtype: object

In [57]:
i = 0
for _, row in cutoff_dates.iterrows():
    print(row)
    print(row['user'], row['min'], row['max'], sep=', ')
    i += 1
    if i == 5:
        break

user                    1.0
min     2015-06-29 00:00:00
max     2018-05-28 00:00:00
Name: 0, dtype: object
1.0, 2015-06-29 00:00:00, 2018-05-28 00:00:00
user                    3.0
min     2018-03-05 00:00:00
max     2018-04-23 00:00:00
Name: 1, dtype: object
3.0, 2018-03-05 00:00:00, 2018-04-23 00:00:00
user                    5.0
min     2017-06-05 00:00:00
max     2018-05-28 00:00:00
Name: 2, dtype: object
5.0, 2017-06-05 00:00:00, 2018-05-28 00:00:00
user                    6.0
min     2016-12-05 00:00:00
max     2018-05-28 00:00:00
Name: 3, dtype: object
6.0, 2016-12-05 00:00:00, 2018-05-28 00:00:00
user                    9.0
min     2016-07-18 00:00:00
max     2018-05-28 00:00:00
Name: 4, dtype: object
9.0, 2016-07-18 00:00:00, 2018-05-28 00:00:00

In [52]:
# for _, row in cutoff_dates.iterrows():
#     user = row['user']
#     start_date = row['min']
#     end_date = row['max']
#     all_email.drop(all_email[all_email.user == user]
#                    [all_email.week < start_date].index, inplace=True)
#     all_email.drop(all_email[all_email.user == user]
#                    [all_email.week > end_date].index, inplace=True)